<?php
    //include โหลดไฟล์เข้ามาทำงาน โดยทำงานตั้งแต่เริ่มจนจบโปรแกรม
    //ถ้าหาไฟล์ไม่เจอจะแจ้งเตือนข้อผิดพลาด
    //แล้วข้ามไปทำส่วนอื่นๆต่อ

    //require โหลดไฟล์เข้ามาทำงาน โดยทำงานตั้งแต่เริ่มจนจบโปรแกรม
    //ถ้าหาไฟล์ไม่เจอจะแจ้งเตือนข้อผิดพลาด
    //แล้วหยุดทำงานโปรแกรม

    //include_one() || require_one() เหมือนกัน แต่ว่าทำงานครั้งเดียว
    
    include 'footer.php';

    echo "Hello\tWorld<br>";
    echo "สอนเขียนโปรแกรม PHP <br>";
    
    echo "My name is : $company $year <br>";
    echo "this year is $year";


?>