<?php
    //ตัวดำเนินการทางคณิตศาสตร์
    $a=10;
    $b=2;
    $c = $a + $b;
    echo $a." + ".$b." = ".($a+$b)."<br>";
    echo $a." - ".$b." = ".($a-$b)."<br>";
    echo $a." * ".$b." = ".($a*$b)."<br>";
    echo $a." / ".$b." = ".($a/$b)."<br>";
    echo $a." % ".$b." = ".($a%$b)."<br>";
    echo "<hr>" ;

    //ตัวดำเนินการเปรียบเทียบ
    // == มีค่าเท่ากันหรือไม่ => return (boolean)
    // === มีค่าเหมือนกันหรือไม่ ทั้งค่าข้อมูล และชนิดข้อมูล
    // != หรือ <> มีค่าไม่เท่ากันหรือไม่ => return (boolean)
    // !== มีค่าไม่เหมือนกันหรือไม่ ทั้งค่าข้อมูล และชนิดข้อมูล

    $x=500; //integer
    $y="500"; //string

    var_dump($x == $y);
    var_dump($x === $y);
    var_dump($x != $y);
    var_dump($x !== $y);

    //มากกว่า น้อยกว่า มากกว่าเท่ากับ น้อยกว่าเท่ากับ //ไม่ยกตัวอย่าง
    //spaceship <=>
    // a <=> b => return (int)
    // ได้ค่ากลับมาเป็น int
    // a<b   => -1
    // a=b   => 0
    // a>b   => 1
    var_dump($x <=> $y);
?>