<?php
    //String Operator
    //concat
    //ใช้เครื่องหมาย . 

    $fname="Mino";

    echo "concat : ".$fname." Yamero"."<br>";
    echo "ยังไม่ได้กำหนดค่าให้กับตัวแปร : ".$fname."<br>";

    //ต่อข้อความและกำหนดค่าเข้าไปให้กับตัวแปรนั้น
    //ใช้เครื่องหมาย .=

    echo "กำหนดค่า : ".$fname.=" Yamero"."<br>";
    echo "หลังจากกำหนดค่าให้กับตัวแปร : ".$fname."<br>";

    //เพิ่มค่า ลดค่า //ไม่ได้ยกตัวอย่าง
    //compound assignment // ไม่ได้ยกตัวอย่าง
    //ลำดับความสำคัญของตัวดำเนินการ // ไม่ได้ยกตัวอย่าง





?>